[
  {
    "id": "buenas-practicas-de-react-y-rendimiento-guia-def",
    "title": "Buenas Prácticas de React y Rendimiento: Guía Definitiva",
    "description": "Optimizar el rendimiento de tus aplicaciones React es crucial para ofrecer una experiencia de usuario fluida y eficiente. Este artículo, una guía completa de bu",
    "excerpt": "Optimizar el rendimiento de tus aplicaciones React es crucial para ofrecer una experiencia de usuario fluida y eficiente.  Este artículo, una guía completa de buenas prácticas de React y rendimiento, te proporcionará las herramientas y el conocimiento necesarios para construir aplicaciones React rápidas y escalables, incluso para principiantes. Aprenderás a identificar y solucionar problemas de rendimiento comunes, convirtiendo tu desarrollo en un proceso más eficiente.",
    "keywords": [
      "Buenas prácticas de React y rendimiento",
      "buenas prácticas de react y rendimiento guía",
      "buenas prácticas de react y rendimiento tutorial",
      "buenas prácticas de react y rendimiento mejores prácticas",
      "buenas prácticas de react y rendimiento ejemplos",
      "buenas prácticas de react y rendimiento rendimiento",
      "buenas prácticas de react y rendimiento principiantes",
      "buenas prácticas de react y rendimiento 2025"
    ],
    "author": "hgaruna",
    "category": "Frontend",
    "datePublished": "2025-08-18",
    "path": "/blog/buenas-practicas-de-react-y-rendimiento-guia-def.html",
    "image": "https://images.pexels.com/photos/3861976/pexels-photo-3861976.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "construyendo-apis-restful-eficientes-con-nodejs-",
    "title": "Construyendo APIs RESTful eficientes con Node.js y Express",
    "description": "Este artículo proporciona una guía completa para construir APIs RESTful eficientes utilizando Node.js y Express, cubriendo desde los fundamentos hasta las mejor",
    "excerpt": "Este artículo proporciona una guía completa para construir APIs RESTful eficientes utilizando Node.js y Express, cubriendo desde los fundamentos hasta las mejores prácticas para asegurar un rendimiento óptimo y una escalabilidad robusta. Aprenderás a diseñar, implementar y probar APIs que sean fáciles de mantener y ampliar.",
    "keywords": [
      "Construyendo APIs RESTful eficientes con Node.js y Express",
      "construyendo apis restful eficientes con node.js y express guía",
      "construyendo apis restful eficientes con node.js y express tutorial",
      "construyendo apis restful eficientes con node.js y express mejores prácticas",
      "construyendo apis restful eficientes con node.js y express ejemplos",
      "construyendo apis restful eficientes con node.js y express rendimiento",
      "construyendo apis restful eficientes con node.js y express principiantes",
      "construyendo apis restful eficientes con node.js y express 2025"
    ],
    "author": "hgaruna",
    "category": "Backend",
    "datePublished": "2025-09-01",
    "path": "/blog/construyendo-apis-restful-eficientes-con-nodejs-.html",
    "image": "https://images.pexels.com/photos/1089440/pexels-photo-1089440.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "construyendo-apis-restful-robustas-con-spring-bo",
    "title": "Construyendo APIs RESTful Robustas con Spring Boot y",
    "description": "Este artículo proporciona una guía completa para desarrollar APIs RESTful robustas y escalables utilizando Spring Boot, incluyendo mejores prácticas para la val",
    "excerpt": "Este artículo proporciona una guía completa para desarrollar APIs RESTful robustas y escalables utilizando Spring Boot, incluyendo mejores prácticas para la validación de datos y la prevención de errores comunes.  Aprenderás a implementar validación en el lado del servidor, mejorando la seguridad y la calidad de tus APIs.",
    "keywords": [
      "Construyendo APIs RESTful robustas con Spring Boot y validación de datos",
      "construyendo apis restful robustas con spring boot y validación de datos guía",
      "construyendo apis restful robustas con spring boot y validación de datos tutorial",
      "construyendo apis restful robustas con spring boot y validación de datos mejores prácticas",
      "construyendo apis restful robustas con spring boot y validación de datos ejemplos",
      "construyendo apis restful robustas con spring boot y validación de datos rendimiento",
      "construyendo apis restful robustas con spring boot y validación de datos principiantes",
      "construyendo apis restful robustas con spring boot y validación de datos 2025"
    ],
    "author": "hgaruna",
    "category": "Arquitectura y Patrones",
    "datePublished": "2025-08-25",
    "path": "/blog/construyendo-apis-restful-robustas-con-spring-bo.html",
    "image": "https://images.pexels.com/photos/33681189/pexels-photo-33681189.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "construyendo-apis-restful-seguras-con-jwt-y-spri",
    "title": "Construyendo APIs RESTful Seguras con JWT y Spring Boot",
    "description": "Este artículo proporciona una guía completa sobre cómo construir APIs RESTful seguras utilizando JSON Web Tokens (JWT) y el framework Spring Boot. Aprenderás la",
    "excerpt": "Este artículo proporciona una guía completa sobre cómo construir APIs RESTful seguras utilizando JSON Web Tokens (JWT) y el framework Spring Boot.  Aprenderás las mejores prácticas para asegurar tus endpoints y evitar errores comunes en el desarrollo.",
    "keywords": [
      "Construyendo APIs RESTful seguras con JWT y Spring Boot",
      "construyendo apis restful seguras con jwt y spring boot guía",
      "construyendo apis restful seguras con jwt y spring boot tutorial",
      "construyendo apis restful seguras con jwt y spring boot mejores prácticas",
      "construyendo apis restful seguras con jwt y spring boot ejemplos",
      "construyendo apis restful seguras con jwt y spring boot rendimiento",
      "construyendo apis restful seguras con jwt y spring boot principiantes",
      "construyendo apis restful seguras con jwt y spring boot 2025"
    ],
    "author": "hgaruna",
    "category": "Backend",
    "datePublished": "2025-08-18",
    "path": "/blog/construyendo-apis-restful-seguras-con-jwt-y-spri.html",
    "image": "https://images.pexels.com/photos/3861976/pexels-photo-3861976.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "implementacion-de-autenticacion-segura-con-jwt-e",
    "title": "Implementación de Autenticación Segura con JWT en Node.js",
    "description": "Resumen: Este artículo proporciona una guía completa sobre la implementación de la autenticación segura usando JSON Web Tokens (JWT) en Node.js, cubriendo desde",
    "excerpt": "Resumen: Este artículo proporciona una guía completa sobre la implementación de la autenticación segura usando JSON Web Tokens (JWT) en Node.js, cubriendo desde la generación y verificación de tokens hasta las mejores prácticas para asegurar tu aplicación. Aprenderás a integrar JWT de forma eficiente y segura en tus proyectos Node.js.",
    "keywords": [
      "Implementación de autenticación segura con JWT en Node.js",
      "implementación de autenticación segura con jwt en node.js guía",
      "implementación de autenticación segura con jwt en node.js tutorial",
      "implementación de autenticación segura con jwt en node.js mejores prácticas",
      "implementación de autenticación segura con jwt en node.js ejemplos",
      "implementación de autenticación segura con jwt en node.js rendimiento",
      "implementación de autenticación segura con jwt en node.js principiantes",
      "implementación de autenticación segura con jwt en node.js 2025"
    ],
    "author": "hgaruna",
    "category": "Backend",
    "datePublished": "2025-08-25",
    "path": "/blog/implementacion-de-autenticacion-segura-con-jwt-e.html",
    "image": "https://images.pexels.com/photos/2061168/pexels-photo-2061168.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "implementacion-de-autenticacion-segura-con-jwt-y",
    "title": "Implementación de Autenticación Segura con JWT y OAuth 2.0",
    "description": "Resumen: Este artículo proporciona una guía completa sobre la implementación de una autenticación segura utilizando JSON Web Tokens (JWT) y OAuth 2.0, cubriendo",
    "excerpt": "Resumen: Este artículo proporciona una guía completa sobre la implementación de una autenticación segura utilizando JSON Web Tokens (JWT) y OAuth 2.0, cubriendo aspectos clave como flujos de autorización, manejo de tokens y mejores prácticas para asegurar tu aplicación.",
    "keywords": [
      "Implementación de autenticación segura con JWT y OAuth 2.0",
      "implementación de autenticación segura con jwt y oauth 2.0 guía",
      "implementación de autenticación segura con jwt y oauth 2.0 tutorial",
      "implementación de autenticación segura con jwt y oauth 2.0 mejores prácticas",
      "implementación de autenticación segura con jwt y oauth 2.0 ejemplos",
      "implementación de autenticación segura con jwt y oauth 2.0 rendimiento",
      "implementación de autenticación segura con jwt y oauth 2.0 principiantes",
      "implementación de autenticación segura con jwt y oauth 2.0 2025"
    ],
    "author": "hgaruna",
    "category": "Seguridad",
    "datePublished": "2025-09-01",
    "path": "/blog/implementacion-de-autenticacion-segura-con-jwt-y.html",
    "image": "https://images.pexels.com/photos/31439797/pexels-photo-31439797.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "implementacion-de-seguridad-con-jwt-y-oauth-20-e",
    "title": "Implementación de Seguridad con JWT y OAuth 2.0 en APIs REST",
    "description": "Meta descripción: Este artículo explica cómo implementar seguridad robusta en tus APIs REST usando JSON Web Tokens (JWT) y OAuth 2.0, cubriendo mejores práctica",
    "excerpt": "Meta descripción: Este artículo explica cómo implementar seguridad robusta en tus APIs REST usando JSON Web Tokens (JWT) y OAuth 2.0, cubriendo mejores prácticas y errores comunes para una integración segura y eficiente.",
    "keywords": [
      "Implementación de Seguridad con JWT y OAuth 2.0 en APIs REST",
      "implementación de seguridad con jwt y oauth 2.0 en apis rest guía",
      "implementación de seguridad con jwt y oauth 2.0 en apis rest tutorial",
      "implementación de seguridad con jwt y oauth 2.0 en apis rest mejores prácticas",
      "implementación de seguridad con jwt y oauth 2.0 en apis rest ejemplos",
      "implementación de seguridad con jwt y oauth 2.0 en apis rest rendimiento",
      "implementación de seguridad con jwt y oauth 2.0 en apis rest principiantes",
      "implementación de seguridad con jwt y oauth 2.0 en apis rest 2025"
    ],
    "author": "hgaruna",
    "category": "Seguridad",
    "datePublished": "2025-09-08",
    "path": "/blog/implementacion-de-seguridad-con-jwt-y-oauth-20-e.html",
    "image": "https://images.pexels.com/photos/31439800/pexels-photo-31439800.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "implementacion-de-websockets-con-react-para-chat",
    "title": "Implementación de WebSockets con React para Chat en Tiempo",
    "description": "Resumen: Este artículo guía al lector a través del proceso de implementación de WebSockets con React para crear una aplicación de chat en tiempo real, cubriendo",
    "excerpt": "Resumen:  Este artículo guía al lector a través del proceso de implementación de WebSockets con React para crear una aplicación de chat en tiempo real, cubriendo desde la configuración básica hasta las mejores prácticas y la resolución de errores comunes.  Aprenderás a construir una aplicación robusta y eficiente.",
    "keywords": [
      "Implementación de WebSockets con React para Chat en Tiempo Real",
      "implementación de websockets con react para chat en tiempo real guía",
      "implementación de websockets con react para chat en tiempo real tutorial",
      "implementación de websockets con react para chat en tiempo real mejores prácticas",
      "implementación de websockets con react para chat en tiempo real ejemplos",
      "implementación de websockets con react para chat en tiempo real rendimiento",
      "implementación de websockets con react para chat en tiempo real principiantes",
      "implementación de websockets con react para chat en tiempo real 2025"
    ],
    "author": "hgaruna",
    "category": "Frontend",
    "datePublished": "2025-08-18",
    "path": "/blog/implementacion-de-websockets-con-react-para-chat.html",
    "image": "https://images.pexels.com/photos/3861976/pexels-photo-3861976.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "implementacion-de-websockets-con-socketio-en-nod",
    "title": "Implementación de WebSockets con Socket.IO en Node.js: Una",
    "description": "Meta descripción: Aprende a implementar WebSockets con Socket.IO en Node.js para crear aplicaciones en tiempo real. Esta guía completa cubre la instalación, con",
    "excerpt": "Meta descripción: Aprende a implementar WebSockets con Socket.IO en Node.js para crear aplicaciones en tiempo real.  Esta guía completa cubre la instalación, configuración, manejo de eventos y mejores prácticas para una implementación exitosa.",
    "keywords": [
      "Implementación de WebSockets con Socket.IO en Node.js",
      "implementación de websockets con socket.io en node.js guía",
      "implementación de websockets con socket.io en node.js tutorial",
      "implementación de websockets con socket.io en node.js mejores prácticas",
      "implementación de websockets con socket.io en node.js ejemplos",
      "implementación de websockets con socket.io en node.js rendimiento",
      "implementación de websockets con socket.io en node.js principiantes",
      "implementación de websockets con socket.io en node.js 2025"
    ],
    "author": "hgaruna",
    "category": "Backend",
    "datePublished": "2025-09-08",
    "path": "/blog/implementacion-de-websockets-con-socketio-en-nod.html",
    "image": "https://images.pexels.com/photos/546819/pexels-photo-546819.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "optimizacion-de-consultas-sql-con-postgresql-ind",
    "title": "Optimización de Consultas SQL con PostgreSQL: Índices y",
    "description": "Meta descripción: Aprende a optimizar tus consultas SQL en PostgreSQL utilizando índices y la planificación de consultas para mejorar el rendimiento de tu base ",
    "excerpt": "Meta descripción:  Aprende a optimizar tus consultas SQL en PostgreSQL utilizando índices y la planificación de consultas para mejorar el rendimiento de tu base de datos.  Domina técnicas clave para una gestión eficiente de datos.",
    "keywords": [
      "Optimización de Consultas SQL con PostgreSQL: Índices y Planificación de Consultas",
      "optimización de consultas sql con postgresql: índices y planificación de consultas guía",
      "optimización de consultas sql con postgresql: índices y planificación de consultas tutorial",
      "optimización de consultas sql con postgresql: índices y planificación de consultas mejores prácticas",
      "optimización de consultas sql con postgresql: índices y planificación de consultas ejemplos",
      "optimización de consultas sql con postgresql: índices y planificación de consultas rendimiento",
      "optimización de consultas sql con postgresql: índices y planificación de consultas principiantes",
      "optimización de consultas sql con postgresql: índices y planificación de consultas 2025"
    ],
    "author": "hgaruna",
    "category": "Bases de Datos",
    "datePublished": "2025-08-18",
    "path": "/blog/optimizacion-de-consultas-sql-con-postgresql-ind.html",
    "image": "https://images.pexels.com/photos/8480883/pexels-photo-8480883.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "optimizacion-de-imagenes-para-sitios-web-con-web",
    "title": "Optimización de imágenes para sitios web con WebP y Lazy",
    "description": "Meta Descripción: Aprende a optimizar tus imágenes para una carga web ultrarrápida usando WebP y Lazy Loading. Mejora el SEO, la experiencia de usuario y la vel",
    "excerpt": "Meta Descripción: Aprende a optimizar tus imágenes para una carga web ultrarrápida usando WebP y Lazy Loading. Mejora el SEO, la experiencia de usuario y la velocidad de tu sitio web con estas técnicas.",
    "keywords": [
      "Optimización de imágenes para sitios web con WebP y Lazy Loading",
      "optimización de imágenes para sitios web con webp y lazy loading guía",
      "optimización de imágenes para sitios web con webp y lazy loading tutorial",
      "optimización de imágenes para sitios web con webp y lazy loading mejores prácticas",
      "optimización de imágenes para sitios web con webp y lazy loading ejemplos",
      "optimización de imágenes para sitios web con webp y lazy loading rendimiento",
      "optimización de imágenes para sitios web con webp y lazy loading principiantes",
      "optimización de imágenes para sitios web con webp y lazy loading 2025"
    ],
    "author": "hgaruna",
    "category": "Performance y Optimización",
    "datePublished": "2025-09-08",
    "path": "/blog/optimizacion-de-imagenes-para-sitios-web-con-web.html",
    "image": "https://images.pexels.com/photos/22046780/pexels-photo-22046780.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  },
  {
    "id": "optimizacion-de-imagenes-para-web-con-webp-y-laz",
    "title": "Optimización de Imágenes para Web con WebP y Lazy Loading",
    "description": "Resumen: Aprende a optimizar tus imágenes web para una carga más rápida y eficiente utilizando WebP y Lazy Loading. Esta guía completa te mostrará cómo implemen",
    "excerpt": "Resumen:  Aprende a optimizar tus imágenes web para una carga más rápida y eficiente utilizando WebP y Lazy Loading.  Esta guía completa te mostrará cómo implementar estas técnicas y mejorar el rendimiento de tu sitio web.",
    "keywords": [
      "Optimización de Imágenes para Web con WebP y Lazy Loading",
      "optimización de imágenes para web con webp y lazy loading guía",
      "optimización de imágenes para web con webp y lazy loading tutorial",
      "optimización de imágenes para web con webp y lazy loading mejores prácticas",
      "optimización de imágenes para web con webp y lazy loading ejemplos",
      "optimización de imágenes para web con webp y lazy loading rendimiento",
      "optimización de imágenes para web con webp y lazy loading principiantes",
      "optimización de imágenes para web con webp y lazy loading 2025"
    ],
    "author": "hgaruna",
    "category": "Performance y Optimización",
    "datePublished": "2025-09-01",
    "path": "/blog/optimizacion-de-imagenes-para-web-con-webp-y-laz.html",
    "image": "https://images.pexels.com/photos/24836825/pexels-photo-24836825.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
  }
]