{
  "homepage": {
    "title": "hgaruna - Desarrollo Web Profesional y Marketing Digital en Villa Carlos Paz",
    "description": "Desarrollo web profesional en Villa Carlos Paz, Córdoba. Creamos sitios web personalizados, e-commerce y marketing digital para negocios locales. ¡Potencia tu presencia online!",
    "keywords": "desarrollo web villa carlos paz, diseño web carlos paz, marketing digital córdoba, sitios web profesionales, seo local, e-commerce villa carlos paz",
    "ogTitle": "hgaruna: Desarrollo Web y Marketing Digital en Villa Carlos Paz",
    "ogDescription": "Desarrollo web profesional y marketing digital en Villa Carlos Paz, Córdoba. Sitios web personalizados para negocios locales con las mejores tecnologías.",
    "ogImage": "https://hgaruna.org/logos-he-imagenes/logo3.png",
    "ogUrl": "https://hgaruna.org/"
  },
  "services": {
    "title": "Servicios de Desarrollo Web en Villa Carlos Paz - hgaruna",
    "description": "Servicios completos de desarrollo web en Villa Carlos Paz: sitios web profesionales, e-commerce, SEO local y marketing digital. ¡Transforma tu negocio!",
    "keywords": "servicios desarrollo web villa carlos paz, diseño sitios web carlos paz, marketing digital córdoba, seo local villa carlos paz",
    "ogTitle": "Servicios de Desarrollo Web Villa Carlos Paz - hgaruna",
    "ogDescription": "Servicios profesionales de desarrollo web en Villa Carlos Paz. Sitios web, e-commerce, SEO y marketing digital para tu negocio local.",
    "ogImage": "https://hgaruna.org/logos-he-imagenes/programacion.jpeg",
    "ogUrl": "https://hgaruna.org/planes/"
  },
  "contact": {
    "title": "Contacto Desarrollo Web Villa Carlos Paz - hgaruna",
    "description": "Contacta con hgaruna para desarrollo web profesional en Villa Carlos Paz. Consultas gratuitas, presupuestos personalizados y atención local. ¡Hablemos de tu proyecto!",
    "keywords": "contacto desarrollo web villa carlos paz, presupuesto sitio web carlos paz, consulta desarrollo web córdoba",
    "ogTitle": "Contacto Desarrollo Web Villa Carlos Paz - hgaruna",
    "ogDescription": "Contacta con expertos en desarrollo web en Villa Carlos Paz. Consultas gratuitas y presupuestos personalizados para tu proyecto digital.",
    "ogImage": "https://hgaruna.org/logos-he-imagenes/logo3.png",
    "ogUrl": "https://hgaruna.org/"
  }
}